Repository: 84000/data-translation-memory
Catalog: Toh_357-The_Prophecy_on_Mount_Gosrnga-v.2.tmx
Source language: bo
Languages: en

source: འཕགས་པ་གླང་རུ་ལུང་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Great Vehicle Sūtra The Prophecy on Mount Gośṛṅga

source: བམ་པོ་གཅིག་གོ། །བཅོམ་ལྡན་འདས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to the blessed Mañjuśrī­kumāra­bhūta.

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: ལྷའི་ཡང་ལྷ་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་བསྐལ་པ་གྲངས་མེད་པ་གསུམ་ནས་བསོད་ནམས་ཀྱི་ཚོགས་ཀྱི་རྣམ་པར་སྨིན་པས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བརྙེས་ཏེ།
en: The Buddha Śākyamuni, the god of gods who had attained perfect awakening through the ripening of merit accumulated over three countless eons and then

source: འཛམ་བུའི་གླིང་གི་ལྗོངས་ཀྱི་ཡུལ་གཞན་དུ་འདུལ་བའི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་མཛད་ནས་
en: [The Buddha Śākyamuni, the god of gods who had attained perfect awakening through the ripening of merit accumulated over three countless eons and then] brought disciples throughout the various regions of Jambudvīpa to maturity,

source: ཡུལ་ཡངས་པ་ཅན་གྱི་ཕྱོགས་ཐུབ་པ་དྲང་སྲོང་ཆེན་པོའི་གནས་རྒྱལ་པོའི་ཁབ་ན།
en: [The Buddha Śākyamuni, the god of gods who had attained perfect awakening through the ripening of merit accumulated over three countless eons and then brought disciples throughout the various regions of Jambudvīpa to maturity, ] was residing in Rājagṛha, at the place of the mighty great sages, in the direction of the Vaiśalī region.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་བྱམས་པ་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་དུ་མ་དང་། གནས་བརྟན་ཤཱ་རིའི་བུ་དང་། མཽད་གལ་གྱི་བུ་ལ་སོགས་པ་ཉན་ཐོས་ཆེན་པོ་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུ་དང་། ཚངས་པ་དང་། བརྒྱ་བྱིན་ལ་སོགས་པ་ལྷ་དུ་མ་དང་། ལྷའི་རྒྱལ་པོ་རྣམ་ཐོས་ཀྱི་བུ་ལ་སོགས་པ་འཇིག་རྟེན་སྐྱོང་བ་དུ་མ་དང་། ཀླུའི་རྒྱལ་པོ་ཆེན་པོ་དུ་མ་དང་། གནོད་སྦྱིན་མཐུ་ཆེན་པོ་མང་པོ་དང་། དྲི་ཟའི་རྒྱལ་པོ་གཙུག་ཕུད་ལྔ་པ་ལ་སོགས་པ་དྲི་ཟ་མང་པོ་དང་། མིའམ་ཅིའི་རྒྱལ་པོ་ཡིད་འོང་ལ་སོགས་པ་མིའམ་ཅི་དུ་མ་དང་། རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོ་ལ་སོགས་པ་འཛམ་བུའི་གླིང་གི་མིའི་རྒྱལ་པོ་མང་པོའི་འཁོར་དུ་མ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་སོ། །
en: He was there together with a great retinue of many bodhisattvas, such as the bodhisattva great being noble Maitreya; one thousand two hundred and fifty great hearers, such as the elders Śāriputra and Maudgalyāyana; many gods such as Brahmā and Śakra; many world protectors such as the divine king Vaiśravaṇa; many great nāga kings; many mighty yakṣas; many gandharvas, such as the gandharva king Pañcaśikha; many kinnaras such as the kinnara king Delightful; and many human kings of the Jambudvīpa continent, such as King Bimbisāra.

source: དེ་ནས་དེའི་ཚེ་ལྷའི་ཡང་ལྷ་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པས་ཕྱི་མའི་དུས་ཀྱི་ཡུལ་དགེ་བ་ལ་རྗེས་སུ་དགོངས་ཤིང་མངོན་སུམ་དུ་མཛད་ནས་
en: At that moment, the Buddha Śākyamuni, the god of gods, had a premonition and foresaw the future of a land called Virtue, and thus

source: འཁོར་མང་པོ་ལ་བཀའ་སྩལ་པ།
en: he said to his vast retinue,

source: རིགས་ཀྱི་བུ་བྱང་ཕྱོགས་ལོགས་ན། རི་གླང་རུ་དང་ཉེ་བ་ཆུ་བོ་གོ་མའི་འགྲམ་ན་ཐུབ་པ་དྲང་སྲོང་ཆེན་པོའི་ཕོ་བྲང་མཆོད་རྟེན་གོ་མ་ས་ལ་གན་ད་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: “Noble children, in the north on the shore of River Goma, near Mount Gośṛṅga, is the palace of the mighty great sages—a stūpa called Gomasalaganda.

source: དེར་གདོན་མི་ཟ་བར་བྱ་དགོས་པའི་ཕྲིན་ལས་ཤིག་ཡོད་པས་
en: There are deeds that must, without doubt, be performed there.

source: ད་གཤེགས་པའི་དུས་ལ་བབ་བོ།
en: Now the time to travel there has come.”

source: །དེ་ནས་དེའི་ཚེ་ལྷའི་ཡང་ལྷ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཁོར་ཕལ་མོ་ཆེ་དང་ནམ་མཁའ་ལ་འཕགས་ཏེ
en: The Blessed Buddha, the god of gods, together with most of his retinue then rose up into the sky.

source: དྲི་ཟའི་རྒྱལ་པོ་གཙུག་ཕུད་ལྔ་པ་ལ་སོགས་པ་དྲི་ཟ་གྲངས་མེད་པ་ནི་མདུན་ན་ལྷའི་རོལ་མོ་སྣ་ཚོགས་བྱེད།
en: The gandharva king Pañcaśikha and countless other gandharvas played many divine instruments in front,

source: མིའམ་ཅིའི་རྒྱལ་པོ་ཡིད་འོང་ལ་སོགས་པ་མིའམ་ཅི་དུ་མ་ནི་སྟེང་ནས་མཆོད་པའི་ལས་བྱེད་ཅིང་།
en: and the kinnara king Delightful and many other kinnaras made offerings from above as

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་དབྱངས་དང་ལྷའི་སྐད་ཡིད་དུ་འོང་བས་བསྟོད་བཞིན་དུ་འཁོར་དེ་དག་དང་། མཆོད་པ་དེ་དག་དང་བཅས་ཏེརི་གླང་རུ་ག་ལ་བ་དེར་གཤེགས་སོ། །
en: the Blessed Buddha was praised in enchanting tunes and divine voices. In the midst of that retinue and their homage he proceeded to Mount Gośṛṅga.

source: གཤེགས་ནས་ལྷའི་ཡང་ལྷ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་བཞེངས་བཞིན་དུ་ཞལ་བྱང་ཕྱོགས་སུ་མཚོ་ཆེན་པོ་ཡུན་རིང་པོ་ནས་རྒྱ་མཚོ་ལྟར་འདུག་པ་ལ་གཟིགས་ཏེ།
en: Having arrived there, the Blessed Buddha, the god of gods, stood facing north and gazed for a long time at the large ocean-like lake.

source: སྐུ་དྲང་པོར་བསྲངས་ནས་དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་བྱེ་བ་ཕྲག་བརྒྱ་སྟོང་དུ་མ་ལ་སྙོམས་པར་ཞུགས་ཏེ།
en: With his body upright, he immersed himself in many billions of meditative absorptions of the thus-gone ones.

source: !བསྐལ་པ་གྲངས་མེད་པ་གསུམ་ནས་བདག་ཉིད་ཀྱི་སངས་རྒྱས་ཀྱི་སྤྱོད་པ་སྨོན་ལམ་དང་བསོད་ནམས་མངོན་སུམ་དུ་མཛད་དོ། །
en: After three countless eons, he had actualized the conduct, aspirations, and merit of a buddha.

source: དེ་ནས་དེའི་ཚེ་ལྷའི་ཡང་ལྷ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱིས་རི་གླང་རུ་དང་། ཡུལ་དགེ་བ་དང་། གསེར་གྱི་དཀྱིལ་འཁོར་ནས་སྲིད་པའི་རྩེ་མོའི་བར་དུ་བྱིན་གྱིས་བརླབས་ཏེ།
en: Right then, the Blessed Buddha, the god of gods, blessed Mount Gośṛṅga, the land of Virtue, and everything else from the golden base all the way up to the peak of existence.

source: བསྲུང་བ་དང་། གཙང་བ་དང་། བཀྲ་ཤིས་པ་དང་། མཚམས་བཅད་པ་དང་། བཟླས་བརྗོད་དང་། དགེ་བར་མཛད་དོ། །
en: He granted it protection, purified it, established auspiciousness, secured its boundaries, engaged in recitation, and performed virtue.

source: དེ་ནས་དེའི་ཚེ་ལྷའི་ཡང་ལྷ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱིས་འཁོར་དེ་དག་ཐམས་ཅད་ལ་བཀའ་སྩལ་པ།
en: The Blessed Buddha, the god of gods, then announced to the entire retinue,

source: རི་གླང་རུ་བཅོམ་ལྡན་འདས་ཀྱི་ཕོ་བྲང་མཆོད་རྟེན་གོ་མ་ས་ལ་གན་ད་དང་བཅས། ཡུལ་དགེ་བ་དང་བཅས་པ་འདི་ནི་བསྐལ་པ་བཟང་པོའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ཀྱི་ཕྱག་མཚན་དང་། མ་འདྲེས་པ་དང་། ཐུན་མོང་མ་ཡིན་པ་དང་། དབེན་པ་ཡིན་ཏེ།
en: “Mount Gośṛṅga, along with the Gomasalaganda stūpa—the palace of the blessed ones—and this land of Virtue constitute insignia, distinctions, hallmarks, and distinctive features of all the blessed buddhas of the excellent eon.

source: རྒྱུ་དེས་ན་ཡུལ་འདི་ནི་དགེ་བ་ཞེས་བྱའོ། །
en: It is for that reason that this land is called Virtue.”

source: དེ་ནས་དེའི་ཚེ་ལྷའི་ཡང་ལྷ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱིས་ཡུལ་དགེ་བ་དང་། མཁར་དགེ་བ་ཅན་དང་། དགེ་འདུན་སོ་སོའི་ཀུན་དགའ་ར་བ་དང་། གཙུག་ལག་ཁང་དང་། དགོན་པའི་གནས་དང་། ཡུལ་དེར་སོ་སོ་ནས་བསོད་ནམས་བྱ་བའི་དངོས་པོ་དགེ་བ་བྱེད་པར་འགྱུར་བའི་རྒྱལ་པོ་དང་། ཆོས་དང་ལྡན་པའི་དད་པ་ཅན་དང་། སྦྱིན་བདག་དང་། ལི་ཐམས་ཅད་འབྱུང་བར་ལུང་བསྟན་ཏོ། །
en: The Blessed Buddha, the god of gods, next prophesied the coming of all the meritorious and virtue-performing kings, the faithful ones endowed with the Dharma, the patrons, and all the people of Khotan yet to appear in the land of Virtue, Virtuous Castle, as well as the individual saṅgha enclaves, temples, and hermitages.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་བཀའ་སྩལ་པ།
en: At this point, the Blessed One told the bodhisattvas,

source: རིགས་ཀྱི་བུ་ཁྱེད་རྣམས་ཀྱིས་ཀྱང་མ་འོངས་པའི་དུས་ན་འབྱུང་བའི་ཡུལ་འདིར་ཅི་ནས་ཀྱང་སེམས་ཅན་རྣམས་དམ་པ་ཆེན་པོ་མྱུར་དུ་ཐོབ་པར་འགྱུར་བ་དང་།
en: “Noble children, you must also by all means bless this place so that, in the future, beings here may swiftly attain the utterly sublime and

source: ཏིང་ངེ་འཛིན་འགྲུབ་པར་འགྱུར་བར་བྱིན་གྱིས་རློབས་ཤིག །
en: so that they will accomplish meditative absorption.”

source: དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་མཚོ་རོལ་ནས་ཅུང་ཟད་ཅིག་སླར་བཀྱེད་དེ།
en: Having said these words, the Blessed One retreated slightly from the lake shore.

source: དེའི་མོད་ལ་རི་གླང་རུའི་སྟེང་ན་གདན་ཁྲི་བཤམས་པ་ལ་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་བཞུགས་ནས་
en: Immediately he was seated cross-legged upon a throne arranged at the peak of Mount Gośṛṅga.

source: ཞལ་ནུབ་ཕྱོགས་སུ་བཅོམ་ལྡན་འདས་ཀྱི་ཕོ་བྲང་མཆོད་རྟེན་གོ་མ་ས་ལ་གན་ད་གང་ན་བ་དེ་ལོགས་སུ་གཟིགས་སོ། །
en: Facing west, he looked toward the Gomasalaganda stūpa, the palace of the blessed ones.

source: དེ་ནས་དེའི་ཚེ་འཇིག་རྟེན་གྱི་ཁམས་གཞན་དང་གཞན་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཉི་ཁྲི་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པའི་དྲང་སྲོང་མང་པོ་དང་ཐབས་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་ལྷགས་སོ། །
en: At that moment, twenty thousand bodhisattvas from other world systems and many sages endowed with the five superknowledges arrived together before the Blessed One.

source: ལྷགས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཕོ་བྲང་མཆོད་རྟེན་གོ་མ་ས་ལ་གན་ད་ལ་ཡང་ཕྱག་འཚལ་སྐྱབས་སུ་སོང་།
en: Having arrived, they prostrated to the Gomasalaganda stūpa, the palace of the blessed ones, and went there to take refuge.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཁོར་དང་བཅས་པ་ལ་ཡང་ཕྱག་འཚལ། སྐྱབས་སུ་སོང་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: They also prostrated and went for refuge to the Blessed Buddha and his retinue, and then stood together to one side.

source: དེ་ནས་དེའི་ཚེ་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱིས་འཁོར་ཕལ་མོ་ཆེ་འདུས་པར་མཁྱེན་ནས་
en: At that moment the Blessed Buddha was aware that the majority of the retinue had gathered, so

source: འཁོར་དེ་དག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: he addressed the retinue:

source: བསྐལ་པ་བཟང་པོ་འདི་ལ་སྔོན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་བཞི་བྱུང་སྟེ།
en: “Previously in this excellent eon four blessed ones appeared and

source: དེ་དག་གིས་ཀྱང་མཆོད་རྟེན་གོ་མ་ས་ལ་གན་ད་ཡུལ་དང་བཅས་པ་བྱིན་གྱིས་བརླབས་སོ། །
en: they too blessed this Gomasalaganda stūpa as well as this country.

source: བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ། མ་འོངས་པའི་དུས་ནའང་སངས་རྒྱས་སྟོང་རྩ་གཅིག་འབྱུང་བར་འགྱུར་ཏེ།
en: In the future, during this excellent eon, one thousand and one buddhas will appear, and

source: དེ་དག་ཐམས་ཅད་ཀྱང་འཁོར་དང་བཅས་ཏེ་འདིར་གཤེགས་ནས་མཆོད་རྟེན་གོ་མ་ས་ལ་གན་ད་ཡུལ་དང་བཅས་པ་བྱིན་གྱིས་རློབ་ཅིང་
en: they too will all come here with their retinues and bless this Gomasalaganda stūpa and this country.

source: མཚམས་གཅད་པ་དང་། བཀྲ་ཤིས་པ་དང་། དགེ་བར་མཛད་པར་འགྱུར་རོ། །
en: They will secure its boundaries and establish auspiciousness and virtue.

source: ང་ཡང་ད་ལྟར་བྱིན་གྱིས་རློབ་པའི་དུས་ལ་བབ་པས་བྱིན་གྱིས་རློབ་པར་མཛད་དོ། །
en: Now the time has come for me too to bless it, so I will do so.”

source: དེ་ནས་དེའི་ཚེ་ལྷའི་ཡང་ལྷ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཏིང་ངེ་འཛིན་ད་ལྟར་གྱི་སངས་རྒྱས་མངོན་སུམ་དུ་བཞུགས་པ་ཞེས་བྱ་བ་དང་། གཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་གྲངས་མེད་པ་ལ་སྙོམས་པར་ཞུགས་སོ། །
en: The Blessed Buddha, the god of gods, now rested in the meditative absorption called the presence of present buddhas and countless other absorptions of the thus-gone ones.

source: དེའི་ཚེ་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། བསམ་གཏན་པ་རྣམས་ཡོངས་སུ་སྐྱོང་བར་བྱེད་པ་བྱང་ཆུབ་སེམས་དཔའ་མཐུ་ཆེན་ཐོབ་ཀྱིས་ཀྱང་སངས་རྒྱས་འོད་སྲུང་གི་མཆོད་རྟེན་གྱི་དྲུང་དུ་བཞུགས་ཏེ
en: At that time, the bodhisattva Mahā­sthāmprāpta, nurturer of those who are resting in absorption and engaged in the concentrations, sat in front of the Buddha Kāśyapa’s stūpa.

source: ཡུལ་དེ་བྱུང་བར་གྱུར་པའི་ཚེ་བདག་གི་གཟུགས་བརྙན་བྱེད་པར་འགྱུར་བར་ས་གཞི་དེ་བྱིན་གྱིས་བརླབས་སོ། །
en: He blessed that area so that in the future people would construct an image of him in that region.

source: དེ་བཞིན་དུ་སྨོན་ལམ་ཆེན་པོས་གནས་པ་བྱང་ཆུབ་སེམས་དཔའ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་ཀྱང་རི་གླང་རུ་ལ་གཙུག་ལག་ཁང་སྤོང་བྱེད་ཅེས་བྱ་བ་འབྱུང་བར་འགྱུར་བའི་ས་གཞི་དེར་བསྙེན་པ་བྱེད་པ་རྣམས་འགྲུབ་པར་འགྱུར་བར་བྱིན་གྱིས་བརླབས་སོ། །
en: Likewise, the bodhisattva Mañjuśrī­kumāra­bhūta, who engages in vast aspirations, blessed the ground on Mount Gośṛṅga where a temple called Relinquishing was to appear, so that all those who come to that place could fulfill their aims.

source: དེ་བཞིན་དུ་ནམ་མཁའ་ལྟར་སྟོབས་དཔག་ཏུ་མེད་པ་བྱང་ཆུབ་སེམས་དཔའ་ནམ་མཁའི་སྙིང་པོས་ཀྱང་གཙུག་ལག་ཁང་འཇིག་ཚོགས་སྤོང་བྱེད་ཅེས་བྱ་བ་འབྱུང་བར་འགྱུར་བའི་ས་གཞི་དེ་མཆོད་གནས་སུ་འགྱུར་བར་བྱིན་གྱིས་བརླབས་སོ། །
en: Likewise, the bodhisattva Ākāśagarbha, who has strength that is as immeasurable as space, blessed the area where a temple called Relinquishing the Personality was to appear, so that it could become a place of worship.

source: དེ་བཞིན་དུ་ཐུགས་རྗེ་ཆེན་པོ་དང་ལྡན་པ་བྱང་ཆུབ་སེམས་དཔའ་འཕགས་པ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་ཕྱུག་གིས་ཀྱང་གཙུག་ལག་ཁང་འོད་ཅན་ཞེས་བྱ་བ་འབྱུང་བར་འགྱུར་བའི་ས་གཞི་དེར་དངོས་གྲུབ་འགྲུབ་པར་བྱིན་གྱིས་བརླབས་སོ། །
en: Likewise, the bodhisattva noble Avalokiteśvara, who is endowed with great compassion, blessed the ground where a temple called Radiant was to appear, so that the attainments could be accomplished there.

source: དེ་བཞིན་དུ་རྟག་ཏུ་བྱམས་པ་དང་ལྡན་པ་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས་ཀྱང་གཙུག་ལག་ཁང་བི་སི་མོ་ཉ་ཞེས་བྱ་བ་འབྱུང་བར་འགྱུར་བའི་ས་གཞི་དེར་བདག་ཉིད་བཞུགས་པར་བྱིན་གྱིས་བརླབས་སོ། །
en: Likewise, the bodhisattva Maitreya, who is endowed with constant love, blessed the ground where a temple called Visimonya was to appear, so that he could reside there.

source: དེ་བཞིན་དུ་སྤྱོད་པ་ཤིན་དུ་རྣམ་པར་དག་པ་བྱང་ཆུབ་སེམས་དཔའ་སའི་སྙིང་པོས་ཀྱང་གཙུག་ལག་ཁང་ཡེ་ཤེས་རི་ཞེས་བྱ་བ་འབྱུང་བར་འགྱུར་བའི་ས་གཞི་དེ་ཕྱག་བྱ་བར་འོས་པར་འགྱུར་བར་བྱིན་གྱིས་བརླབས་སོ། །
en: Likewise, the bodhisattva Kṣitigarbha, who has impeccable conduct, blessed the ground where a temple called Wisdom Mountain was to appear, so that that place would be worthy of homage.

source: དེ་བཞིན་དུ་འདུལ་བའི་སྐྱེ་བོ་རྣམས་གྲོལ་བར་མཛད་པ་ལ་ཐགས་ཐོགས་མི་མངའ་བ་བྱང་ཆུབ་སེམས་དཔའ་སྨན་གྱི་རྒྱལ་པོས་ཀྱང་གཙུག་ལག་ཁང་བ་ནོ་ཅོ་ཞེས་བྱ་བ་འབྱུང་བར་འགྱུར་བའི་ས་གཞི་དེར་དངོས་གྲུབ་འགྲུབ་པར་འགྱུར་བར་བྱིན་གྱིས་བརླབས་སོ། །
en: Likewise, the bodhisattva Bhaiṣajyarāja, who possesses an unlimited ability to liberate beings to be trained, blessed the ground where a temple called Vanoco was to appear, so that the attainments could be accomplished there.

source: དེ་བཞིན་དུ་རྫུ་འཕྲུལ་ཆེན་པོ་དང་ལྡན་པ་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་དུ་བཟང་པོས་ཀྱང་གཙུག་ལག་ཁང་དགེ་འདུན་སྐྱོང་ཞེས་བྱ་བ་འབྱུང་བར་འགྱུར་བའི་ས་གཞི་དེར་དངོས་གྲུབ་འགྲུབ་པར་འགྱུར་བར་བྱིན་གྱིས་བརླབས་སོ། །
en: Likewise, the bodhisattva Samantabhadra, who possesses great miraculous powers, blessed the ground where a temple called Sustaining the Saṅgha was to appear, so that the attainments could be accomplished there.

source: དེ་བཞིན་དུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་གཞན་དག་དང་། དགྲ་བཅོམ་པ་ཆེན་པོ་རྣམས་ཀྱིས་ཀྱང་ལི་ཡུལ་གང་དང་གང་དུ་གཙུག་ལག་ཁང་དང་། སྐྱེད་མོས་ཚལ་དང་། དགོན་པའི་གནས་འབྱུང་བར་འགྱུར་བའི་ས་གཞི་ཐམས་ཅད་དཔེར་ན་ཟླ་བ་ཉ་བ་ལ་སྐར་མའི་ཚོགས་རྣམས་ཀྱིས་ཡོངས་སུ་བསྐོར་ནས་སྟེང་གི་བར་སྣང་དག་པ་ལ་རྒྱུ་བ་བཞིན་དུ་མཛེས་པ་དང་། ཡིད་དུ་འོང་བ་དང་། རྒྱས་པ་དང་། དགའ་དགའ་ལྟར་འདུག་པར་བྱིན་གྱིས་བརླབས་སོ། །
en: In this way, the Blessed Buddha, the other bodhisattvas, and all of the great worthy ones blessed the ground for all the temples, parks, and hermitages that were to appear throughout the land of Khotan so that they would be as beautiful, delightful, prosperous, and enchanting as the full moon encircled by the constellations of stars, orbiting through a clear sky.

source: ཡང་དེའི་ཚེ་རི་གླང་རུ་ལ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་བཞུགས་པ་དང་།
en: While the Blessed Buddha was present at Mount Gośṛṅga,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དང་། དགྲ་བཅོམ་པ་ཆེན་པོ་རྣམས་ཀྱིས་འོད་ཟེར་རྣམ་པ་སྣ་ཚོགས་དུ་མ་བཀྱེ་བས་ལི་ཡུལ་ཐམས་ཅད་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་བྱས་སོ། །
en: all the bodhisattva great beings and the great worthy ones projected an array of light rays that illuminated the entire land of Khotan.

source: དེ་ནས་སྐད་ཅིག་དེ་ཉིད་ལ་མཚོ་ཆེན་པོ་དེའི་ནང་ན་པད་མ་སུམ་བརྒྱ་ལྔ་བཅུ་རྩ་གསུམ་བྱུང་བར་གྱུར་ཏེ།
en: At that very moment, three hundred and fifty-three lotuses emerged from the vast lake there.

source: པད་མ་རེ་རེའི་ནང་ན་ཡང་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྐུ་གཟུགས་འོད་དང་བཅས་པ་བཞུགས་པ་སྣང་བར་གྱུར་ཏོ། །
en: Inside each of these lotuses appeared the bodies of buddhas and bodhisattvas glowing with light.

source: དེ་ནས་དེའི་ཚེ་ལྷ་རྣམས་ཀྱིས་སྔོན་མ་མཐོང་བའི་མཚན་མ་མཐོང་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ་དང་།
en: At that moment, the gods, seeing these signs—signs the likes of which they had never seen before—inquired of the Blessed Buddha as to their meaning.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The Blessed One replied,

source: རིགས་ཀྱི་བུ་མཚོའི་ནང་ནས་པད་མ་སུམ་བརྒྱ་ལྔ་བཅུ་རྩ་གསུམ་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྐུ་གཟུགས་དང་བཅས་ཏེ་བྱུང་བ་འདི་ནི་མ་འོངས་པའི་དུས་ན་ཡུལ་འདི་བྱུང་བར་གྱུར་པའི་ཚེ་ཡུལ་འདི་ཉིད་དུ་པད་མ་ཇི་སྙེད་པའི་དགོན་པའི་གནས་དང་། གཙུག་ལག་ཁང་ན་གཎ་ཌཱི་བརྡུང་བར་འགྱུར་བ་དང་།
en: “Noble children, the appearance of these three hundred and fifty-three lotuses containing the bodies of the buddhas and bodhisattvas is a portent that in the future, when this land manifests, there will appear here, equal in number to these lotuses, hermitages and temples where the gong will be struck.

source: གནས་གང་དང་གང་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དང་། ཉན་ཐོས་ཆེན་པོ་རྣམས་དང་། འོད་ཟེར་རྣམ་པ་སྣ་ཚོགས་འགྱེད་ཅིང་ཡུལ་བྱིན་གྱིས་བརླབས་པའི་ས་གཞི་དེ་དག་དང་།
en: This is a portent that in all of these places—the places where the land has been blessed by bodhisattva great beings, great hearers, and the array of projected light rays, and

source: དེ་བཞིན་དུ་ངས་དེ་བཞིན་གཤེགས་པའི་ཕོ་བྲང་མཆོད་རྟེན་གོ་མ་ས་ལ་གན་ད་ཡུལ་དགེ་བ་དང་བཅས་པ་བྱིན་གྱིས་བརླབས་པའི་ས་གཞི་འདིར་
en: [This is a portent that in all of these places—the places where the land has been blessed by bodhisattva great beings, great hearers, and the array of projected light rays, and] where I have blessed the Gomasalaganda stūpa, the palace of the thus-gone ones, and this land of Virtue—

source: དད་པ་ཅན་གྱི་སྦྱིན་བདག་རྣམས་ཀྱིས་སོ་སོ་ནས་སངས་རྒྱས་ལ་སོགས་པའི་གཟུགས་བརྙན་བྱེད་པར་འགྱུར་ཞིང་།
en: [This is a portent that in all of these places—the places where the land has been blessed by bodhisattva great beings, great hearers, and the array of projected light rays, and where I have blessed the Gomasalaganda stūpa, the palace of the thus-gone ones, and this land of Virtue—] faithful patrons will all fashion images of the Buddha and others, and that

source: གནས་དེ་དང་དེ་དག་ཏུ་བསྙེན་པར་བྱས་ན་ཅི་དང་ཅི་འདོད་པ་འགྲུབ་པར་འགྱུར་བའི་སྔ་ལྟས་ཡིན་ནོ། །
en: [This is a portent that in all of these places—the places where the land has been blessed by bodhisattva great beings, great hearers, and the array of projected light rays, and where I have blessed the Gomasalaganda stūpa, the palace of the thus-gone ones, and this land of Virtue—faithful patrons will all fashion images of the Buddha and others, and that] whoever arrives in these places will accomplish all their wishes.”

source: ཡང་དེའི་ཚེ་ལྷ་རྣམས་སྟན་ལས་ལངས་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: At this point, the gods rose from their seats and asked the Blessed One,

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཡུལ་འདི་དུས་ཇི་ཙམ་ཞིག་ན་ནི་འབྱུང་བར་འགྱུར།
en: “Respected Blessed One, at what point in time will this land appear?

source: སུ་ཞིག་གིས་ནི་འབྱིན་པར་བགྱིད་པ་ལགས།
en: Who will be its founders?

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ད་ལྟར་ནི་དགོན་པ་ཆབ་ཆེན་པོའི་གཏེར་ལགས་ན། སུ་ཞིག་གིས་ཇི་ལྟར་འབྱིན་པ་བཀའ་སྩལ་དུ་གསོལ།
en: Esteemed Blessed One, it is now a wilderness with an abundance of water, so who will be the founders, and how?”

source: རིགས་ཀྱི་བུ་ཉོན་ཅིག །
en: “Noble children, listen.

source: ང་མྱ་ངན་ལས་འདས་ནས་ལོ་བརྒྱ་ལོན་པའི་ཚེ་རྒྱའི་ཡུལ་དུ་རྒྱའི་རྒྱལ་པོ་ཅ་ཡང་ཞེས་བྱ་བ་བུ་སྟོང་ཚང་བར་བདོག་པ་ཞིག་འབྱུང་བར་འགྱུར་ཏེ
en: One hundred years after my nirvāṇa, there will appear in China a king called Cayang, who will have a thousand sons.

source: བུ་རེ་རེ་ལ་ཡང་ཡུལ་རེ་རེ་གསར་དུ་ཚོལ་དུ་བཅུག་གོ། །
en: He will order each of his sons to search for a piece of virgin land.

source: ཕྱིས་ནུབ་ཕྱོགས་ལོགས་ནས་རི་གླང་རུ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཕོ་བྲང་མཆོད་རྟེན་གོ་མ་ས་ལ་གན་ད་ཡོད་པའི་ཡུལ་དེ་བཞིན་གཤེགས་པ་དུ་མས་བྱིན་གྱིས་བརླབས་བརླབས་པ་ཞིག་ཡོད་དོ་
en: Later on, he will hear that in the west there is a hill called Gośṛṅga and a land containing the Gomasalaganda stūpa, the palace of the thus-gone ones, which have been blessed by many thus-gone ones.

source: ཞེས་ཐོས་ནས་དེ་འདི་སྙམ་
en: Hearing this, he will think,

source: དུ་མ་ལ་བདག་ལ་བུ་ཅིག་ཡོད་ན་སངས་རྒྱས་ཕལ་མོ་ཆེས་བྱིན་གྱིས་བརླབས་པའི་གནས་དེར་ཡུལ་འདེབས་སུ་གཞུག་གོ་སྙམ་དུ་བསམས་ནས།
en: ‘Oh, if only I had another son, I would send him to cultivate that land, which has been blessed by so many buddhas.’

source: དེའི་ཚེ་རྒྱའི་རྒྱལ་པོས་རྣམ་ཐོས་ཀྱི་བུ་ལ་བུ་ཅིག་བསླངས་སོ། །
en: At that time, that Chinese king will request Vaiśravaṇa to grant him a son.

source: རྣམ་ཐོས་ཀྱི་བུས་ཀྱང་འཛམ་བུའི་གླིང་འདི་ན་རྒྱལ་པོ་མྱ་ངན་མེད་ཅེས་བྱ་བའི་བུ་ཞིག་བཙས་པ་བྱིན་ཏེ།
en: But Vaiśravaṇa will grant him a son of King Aśoka, here in Jambudvīpa.

source: བུ་དེ་ནི་གཟུགས་བཟང་བ། དབྱིབས་མཛེས་པ། བལྟ་ན་སྡུག་པ་ཞིག་ཡིན་ནོ། །
en: This boy will have an excellent body, a beautiful appearance, and he will be a delight to the eyes.

source: བུ་དེའི་དོན་དུ་ས་ལས་ནུ་མ་ཞིག་བྱུང་བ་དང་།
en: For this boy, a breast will appear from the ground and,

source: བུ་དེ་སྔོན་གྱི་བསོད་ནམས་དང་དགེ་བའི་རྩ་བའི་མཐུས་ནུ་མ་དེ་ལ་ནུ་བར་བྱེད་པས་དེས་ན་
en: through the strength of his previous merits and roots of virtue, he will suckle this breast. As a result,

source: བུ་དེའི་མིང་ས་ལས་ནུ་མ་ནུ་ཞེས་བྱ་བའོ། །
en: he will become known by the name Suckler of the Earth Breast.

source: བུ་དེ་མྱུར་བར་སྐྱེས་ནས་ཕ་རྒྱའི་རྒྱལ་པོས་རྒྱལ་སྲིད་ཀྱི་དབང་ནི་བསྐུར།
en: He will mature quickly, and his father, the Chinese king, will confer royal power upon him,

source: ནོར་མང་པོ་ནི་བྱིན།
en: [He will mature quickly, and his father, the Chinese king, will confer royal power upon him,] bestow upon him a mass of wealth, and

source: བློན་པོ་ཕལ་མོ་ཆེ་ནི་ལུས་ཀྱི་རིམ་གྲོ་བར་བསྐོས་ནས།
en: [He will mature quickly, and his father, the Chinese king, will confer royal power upon him, bestow upon him a mass of wealth, and] assign most of the ministers as his servants.

source: རྒྱལ་བུ་ས་ལས་ནུ་མ་ནུ་དེ་བློན་པོ་ཆེན་པོ་ཇང་ཤོ་ཞེས་བྱ་བ་ལ་སོགས་པ་དམག་དུ་མ་དང་ལྷན་ཅིག་ཏུ་རྒྱའི་ཡུལ་ནས་བྱུང་སྟེ་ཡུལ་འདིར་འོང་བར་འགྱུར་རོ། །
en: The prince Suckler of the Earth Breast, together with a senior minister called Jangsho and many soldiers, will then leave China and come to this land.

source: འོངས་ནས་འདིར་ཡུལ་འདེབས་པར་འགྱུར་ཏེ།
en: Arriving here, they will cultivate the land and,

source: རྒྱལ་བུ་ས་ལས་ནུ་མ་ནུ་དེས་ཡུལ་བཏབ་པའི་ཕྱིར་རྒྱུ་དེས་ན་ཡུལ་འདིའི་མིང་ནི་ས་ལས་ནུ་མ་ནུའི་ཡུལ་ཞེས་བྱ་བར་འགྱུར་རོ། །
en: in order to found the country, Prince Suckler of the Earth Breast will name the place Land of Suckler of the Earth Breast.

source: དུས་དེའི་ཚེ་ན་ནུབ་ཕྱོགས་ལོགས་ནས་རྒྱ་གར་གྱི་མི་ཕལ་མོ་ཆེ་འདིར་འོང་བར་འགྱུར་ཏེ།
en: “At that time, many Indian people will travel here from the west and

source: རྒྱལ་པོ་ས་ལས་ནུ་མ་ནུའི་འབངས་སུ་མཆིད་ཀྱིས་
en: request to become subjects of King Suckler of the Earth Breast.

source: འཚལ་ཞིང་ཆུ་སྲིད་གཅིག་པར་དུམ་བར་གྱུར་ནས།
en: Thus, that single kingdom will contain various people.

source: རྒྱའི་བློན་པོ་ཆེན་པོ་ཇང་ཤོ་ལ་སོགས་པས་རིམ་གྱིས་རྒྱ་དང་། རྒྱ་གར་གྱི་གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་འདེབས་པར་འགྱུར་རོ། །
en: The Chinese senior minister Jangsho, together with others, will then gradually found both Chinese and Indian villages, towns, and markets.

source: དེ་ལྟར་རྒྱལ་པོ་ས་ལས་ནུ་མ་ནུ་དེ་མི་རབས་དུ་མའི་བར་དུ་ཡུལ་འདིའི་རྒྱལ་པོ་བྱེད་པར་འགྱུར་རོ། །
en: In that way, King Suckler of the Earth Breast and his descendants will rule over these lands for many generations.

source: རྒྱལ་པོ་དེ་རྣམས་ཀྱིས་ཀྱང་རིམ་གྱིས་སོ་སོ་ནས་ཡུལ་འདིར་དགོན་པའི་གནས་དང་གཙུག་ལག་ཁང་བྱས་ན་ཞིང་ཆུ་དང་། འབངས་དང་། ཞལ་ཏ་བྱེད་པ་ཡང་འབུལ་ཞིང་།
en: Each of these kings will, in turn, build hermitages and temples and offer them irrigation water, subjects, and counsel.

source: ལ་ལ་ཡང་བདག་ཉིད་ཀྱང་རབ་ཏུ་འབྱུང་བར་བྱེད་དོ། །
en: Some of them will even take ordination themselves.

source: ལ་ལ་ནི་བུ་དང་བུ་མོ་རབ་ཏུ་འབྱིན་པར་བྱེད་དོ། །
en: Some of them will have their sons and daughters take ordination.

source: ལ་ལ་ནི་འབངས་ལས་གྲངས་མེད་པ་ཞིག་རབ་ཏུ་འབྱུང་བར་གནང་བར་བྱེད་དོ། །
en: Some of them will allow countless numbers of their subjects to take ordination.

source: ཡུལ་འདིར་མི་བྱང་ཆུབ་སེམས་དཔའི་རིགས་ཅན་མང་པོ་ཞིག་འབྱུང་སྟེ།
en: In this land, there will appear many people with the nature of bodhisattvas,

source: རྟག་ཏུ་དཀོན་མཆོག་གསུམ་ལས་དགེ་བའི་རྩ་བ་སོགས་ཤིང་བསོད་ནམས་བྱ་བའི་དངོས་པོ་བྱེད་པར་འགྱུར་རོ། །
en: who will constantly gather roots of virtue and engage in meritorious deeds based on the Three Jewels.

source: དེ་ལྟར་ན་ཡུལ་འདི་ནི་རྒྱལ་པོ་ས་ལས་ནུ་མ་ནུས་ཡུལ་གཏོད་པའི་ཚུལ་དེ་ལྟ་བུས་འབྱུང་བར་འགྱུར་རོ། །
en: In this way, King Suckler of the Earth Breast will establish this land.
